export interface Optionz {
  value: string | number
  label: string
  children?: Optionz[]
  day: number
  subject: number
}

export const optionsCours: Optionz[] = [
  {
    label: "1.คอร์ส 6 ชั่วโมง (หนึ่งวัน, 9.00-16.00) เลือกได้ 2 วิชา",
    value: 1,
    day: 1,
    subject: 2,
  },
  {
    label:
      "2.คอร์ส 9 ชั่วโมง (สองวัน, 9.00-16.00) และวันที่สอง 9.00-12.00 เลือกได้ 3 วิชา + กิจกรรมช่วงค่ำ (เลือกหรือไม่ก็ได้)",
    value: 2,
    day: 2,
    subject: 3,
  },
  {
    label:
      "3.คอร์ส 12 ชั่วโมง (สองวัน, 9.00-16.00) และวันที่สอง 9.00-12.00 เลือกได้ 4 วิชา + กิจกรรมช่วงค่ำ (เลือกหรือไม่ก็ได้)",
    value: 3,
    day: 2,
    subject: 4,
  },
  {
    label:
      "4.คอร์ส 15 ชั่วโมง (สามวัน, 9.00-16.00) และวันที่สอง 9.00-12.00 เลือกได้ 5 วิชา + กิจกรรมช่วงค่ำ 2 ครั้ง (เลือกหรือไม่ก็ได้)",
    value: 4,
    day: 3,
    subject: 5,
  },
  {
    label:
      "5.คอร์ส 18 ชั่วโมง (สามวัน, 9.00-16.00) และวันที่สอง 9.00-12.00 เลือกได้ 6 วิชา + กิจกรรมช่วงค่ำ 2 ครั้ง (เลือกหรือไม่ก็ได้)",
    value: 5,
    day: 3,
    subject: 6,
  },
]

export const schoolsize = [
  { size: "ขนาดเล็ก", option: "1" },
  { size: "ขนาดกลาง", option: "2" },
  { size: "ขนาดใหญ่", option: "3" },
  { size: "ขนาดใหญ่พิเศษ", option: "4" },
]

export const courses = {
  status: "success",
  courses: [
    {
      name: "คอร์ส 6 ชั่วโมง",
      description: "(หนึ่งวัน, 9.00-16.00) เลือกได้ 2 วิชา",
      timeSlot: 2,
    },
    {
      name: "คอร์ส 9 ชั่วโมง",
      description:
        "(สองวัน, วันแรก 9.00-16.00 และวันที่สอง 9.00-12.00) เลือกได้ 3 วิชา + กิจกรรมช่วงคํ่า (เลือกหรือไม่เลือกก็ได้)",
      timeSlot: 3,
    },
    {
      name: "คอร์ส 12 ชั่วโมง",
      description:
        "(สองวัน, วันแรก 9.00-16.00 และวันที่สอง 9.00-16.00) เลือกได้ 4 วิชา + กิจกรรมช่วงคํ่า (เลือกหรือไม่เลือกก็ได้)",
      timeSlot: 4,
    },
    {
      name: "คอร์ส 15 ชั่วโมง",
      description:
        "(สองวัน, วันแรก 9.00-16.00, วันที่สอง 9.00-16.00 และวันที่ 3 9.00-12.00) เลือกได้ 5 วิชา + กิจกรรมช่วงคํ่า 2 ครั้ง (เลือกหรือไม่เลือกก็ได้)",
      timeSlot: 5,
    },
    {
      name: "คอร์ส 18 ชั่วโมง",
      description:
        "(สองวัน, วันแรก 9.00-16.00, วันที่สอง 9.00-16.00 และวันที่ 3 9.00-16.00) เลือกได้ 6 วิชา + กิจกรรมช่วงคํ่า 2 ครั้ง (เลือกหรือไม่เลือกก็ได้)",
      timeSlot: 6,
    },
  ],
}
